/* Заполнить таблицы данными. */

-- Вставка городов
INSERT INTO city (title) VALUES ('Москва'), ('Санкт-Петербург'), ('Казань');

-- Вставка амплуа игроков
INSERT INTO player_position (title) VALUES ('нападающий'), ('защитник'), ('полузащитник'), ('вратарь');

-- Вставка тренеров
INSERT INTO coach (full_name, phone_number) VALUES 
    ('Шувалов Шувалов Михаилович', '1234567890'),
    ('Белов Лука Федосеевич', '0987654321')
;

-- Вставка игровых площадок
INSERT INTO venue (capacity, city_id, title) VALUES 
    (50000, 1, 'Стадион А'),
    (30000, 2, 'Стадион Б')
;

-- Вставка команд
INSERT INTO team (title, city_id, coach_id) VALUES 
    ('Команда А', 1, 1),
    ('Команда Б', 2, 2),
    ('Команда В', 3, 2)
;

-- Вставка игроков
INSERT INTO player (full_name, birth_date, position_id, salary, team_id) VALUES 
    ('Виноградов Оскар Олегович', '2000-01-01', 1, 100000.00, 1),
    ('Волков Юстин Георгиевич', '1992-02-02', 2, 80000.00, 1),
    ('Васильев Давид Артемович', '1995-03-03', 3, 90000.00, 2),
    ('Фомин Платон Куприянович', '1988-04-04', 4, 95000.00, 2),
    ('Мартынов Тимофей Вячеславович', '1983-06-25', 1, 105000.00, 1),
    ('Орехов Лев Кимович', '2002-06-16', 1, 75000.00, 2),
    ('Нестеров Карл Святославович', '1996-10-07', 1, 125000.00, 2),
    ('Ширяев Эрик Яковович', '1998-05-09', 1, 145000.00, 1),
    ('Ковалев Самсон Филиппович', '2002-08-07', 1, 135000.00, 3)
;

-- Вставка игр
INSERT INTO game (stadium_id, holding_date, team1_score, team2_score, team1_id, team2_id) VALUES 
    (1, '2018-05-01', 2, 1, 1, 2),
    (2, '2019-06-01', 1, 3, 2, 1)
;
