/* Заполнить таблицы данными. */

-- Заполнение таблицы званий
INSERT INTO theater_actors.title (name) VALUES
    ('Народный артист РФ'),
    ('Лауреат конкурса'),
    ('Заслуженный артист РФ')
;

-- Заполнение таблицы пьес
INSERT INTO theater_actors.piece (title) VALUES ('Ромео и Джульетта'), ('Дядя Ваня'), ('Три сестры');

-- -- Заполнение таблицы ролей
INSERT INTO theater_actors.role (title, piece_id) VALUES 
    ('Ромео', 1), 
    ('Джульета', 1), 
    ('Астров', 2), 
    ('Сония', 2), 
    ('Маша', 3), 
    ('Оля', 3)
;

-- Заполнение таблицы актеров
INSERT INTO actor (full_name, gender, salary, experience, title_id) VALUES 
    ('Соколов Василий Геннадьевич', 'm', 50000.00, 10, 2),
    ('Иванова Анастасия Николаевна', 'f', 55000.00, 15, 1),
    ('Петров Степан Максимович', 'm', 60000.00, 20, 1),
    ('Сидорова Татьяна Петровна', 'f', 40000.00, 5, 2)
;

-- Заполнение таблицы спектаклей
INSERT INTO performance (set_date, piece_id) VALUES 
    ('2025-01-20', 1),
    ('2025-01-21', 2),
    ('2025-01-22', 3)
;

-- Заполнение таблицы назначений на роли
INSERT INTO assignment (set_date, role_id, actor_id, performance_id) VALUES 
    ('2025-01-20', 1, 1, 1),
    ('2025-01-20', 2, 2, 1),
    ('2025-01-21', 3, 3, 2),
    ('2025-01-21', 4, 4, 2),
    ('2025-01-22', 5, 3, 3)
;
