/* Создать запросы */

-- а) Вывести количество народных и заслуженных артистов РФ не пенсионного возраста (м-65, ж-55). Отсортировать по убыванию количества.
-- б) Вывести ФИО артиста, его звание и премию, составляющую 10% от оклада в том случае, если количество ролей всех артистов более 20. Отсортировать по ФИО артистов и премии по возрастанию.
-- в) Изменить звание артиста Соколова В.Г с Заслуженный артист РФ на Народный артист РФ.
-- г) Удалить спектакли, в которых не принимают участие Народные артисты.
