/* Заполнить таблицы данными. */

-- Вставка городов
INSERT INTO city (title) VALUES ('Санкт-Петербург'), ('Москва'), ('Волгоград'), ('Казань');

-- Вставка специальностей
INSERT INTO specialty (title) VALUES ('Компьютерные сети'), ('Сварщик'), ('Техническое обслуживание');

-- Вставка учебных заведений
INSERT INTO institution (title) VALUES ('Петровский колледж'), ('Казань колледж');

-- Вставка абитуриентов
INSERT INTO applicant (full_name, birth_date, passport, inn, city_id, certificate_score, admission_score, institution_id, specialty_id) VALUES 
    ('Карявин Павел Данилович', '2000-01-01', '1234567890', '123456789012', 1, 350, 370, 1, 1),
    ('Яковлева Дана Матвеевна', '1999-05-15', '0987654321', '098765432109', 2, 380, 390, 1, 1),
    ('Носова Эмбер Христофоровна', '1988-03-20', '1122334455', '112233445512', 3, 300, 320, 2, 2),
    ('Логинова Ада Станиславовна', '2001-07-30', '2233445566', '223344556623', 1, 360, 380, 1, 1),
    ('Голубева Фаня Вениаминовна', '1985-12-12', '3344556677', '334455667734', 3, 290, 310, 2, 2),
    ('Урусов Илья Себастьянович', '2000-11-01', '4584937275', '456987979957', 4, 250, 290, 2, 1)
;
