/* Заполнить таблицы данными. */

-- Вставка видов грузов
INSERT INTO cargo_type (title) VALUES ('Продукты'), ('Техника'), ('Строительные материалы');

-- Вставка городов
INSERT INTO city (title) VALUES ('Москва'), ('Санкт-Петербург'), ('Волгоград');

-- Вставка водителей
INSERT INTO driver (full_name, gender, birth_date, hire_date, salary) VALUES 
    ('Ильюшин Павел Максимович', 'm', '1965-05-20', '2010-01-15', 30000.00),
    ('Карпов Панкратий Богуславович', 'm', '1980-07-15', '2015-03-01', 19500.00),
    ('Кулаков Авраам Робертович', 'm', '1958-02-28', '2005-06-10', 40000.00),
    ('Воронцов Вячеслав Юрьевич', 'm', '1975-09-30', '2012-05-25', 35000.00),
    ('Пономарёв Яков Яковович', 'm', '1970-03-15', '2000-11-11', 45000.00),
    ('Зайкова Аполлинария Феликсовна', 'f', '1970-01-15', '2000-04-23', 55000.00)
;

-- Вставка перевозок
INSERT INTO transportation (transport_date, cargo_type, cargo_cost, cargo_weight, delivery_city, driver_id) VALUES 
    ('2018-12-10', 1, 500000.00, 12500, 1, 1),
    ('2018-12-10', 2, 80000.00, 8.0, 2, 2),
    ('2018-12-11', 3, 99000.00, 15000, 3, 3),
    ('2019-01-15', 1, 30000.00, 5.0, 1, 4),
    ('2018-12-10', 1, 60000.00, 11.0, 3, 5),
    ('2015-10-09', 3, 400000.00, 11000.0, 3, 6)
;
