/*  Заполнить таблицы данными. */

INSERT INTO sport (title) VALUES ('скалолазание'), ('водный'), ('пешие'), ('конный');

INSERT INTO coach(full_name) VALUES
    ('Кузнецов Алексей Сергеевич'),
    ('Луговой Тимофей Васильевич'),
    ('Сидоров Сидор Сидорович'),
    ('Сысоева Илена Романовна')
;

INSERT INTO tourist(full_name, birth_date, start_year, gender, phone_number, category, rate, coach_id, sport_id) VALUES
    ("Иванов Иван Иваныч", '1995-05-15', 2010, 'm', '9001234567', 'средняя', 1000.00, 4, 3),
    ("Петров Петр Петрович", '2000-08-03', 2020, 'm', '9003456789', 'средняя', 900.00, 2, 3),
    ("Сидорова Мария Петровна", '1992-03-20', 2015, 'f', '9007654321', 'высшая', 1200.00, 4, 4),
    ("Мамонтов Константин Леонтьевич", '1995-01-12', 2015, 'm', '4526783971', 'высшая', 800.00, 1, 2),
    ("Некрасов Афиноген Богданович", '1974-08-28', 1988, 'm', '2992192177', 'высшая', 1250.00, 4, 3),
    ("Михеева Вера Руслановна", '2006-01-28', 2020, 'f', '7355700311', 'средняя', 750.00, 3, 1)
;

INSERT INTO payment(payment_month, amount, tourist_id) VALUES
    ('2024-12-01', 1000.00, 1),
    ('2024-11-01', 1000.00, 1),
    ('2024-10-01', 1000.00, 1),
    ('2024-09-01', 1000.00, 1),
    ('2024-08-01', 950.00, 1),
    ('2024-12-01', 1200.00, 3),
    ('2024-11-01', 1200.00, 3),
    ('2024-10-01', 1200.00, 3),
    ('2024-11-01', 800.00, 4),
    ('2024-10-01', 800.00, 4),
    ('2024-09-01', 800.00, 4),
    ('2024-11-01', 900.00, 2),
    ('2024-10-01', 900.00, 2)
;
