/* Заполнить таблицы данными. */

-- Заполнение таблицы жанров
INSERT INTO genre (title) VALUES
    ('фантастика'),
    ('драма'),
    ('приключения'),
    ('научная фантастика'),
    ('криминал'),
    ('трагедия'),
    ('любовный роман')
;

-- Заполнение таблицы авторов
INSERT INTO author (full_name, phone_number) VALUES 
    ('Иванов Иван Иваныч', '1234567890'),
    ('Петров Петр Петрович', '0987654321'),
    ('Сидоров Сидор Сидорович', '1122334455')
;

-- Заполнение таблицы издателей
INSERT INTO publisher (title) VALUES ('Сова'), ('Птица'), ('Лев');

-- Заполнение таблицы книг
INSERT INTO book (title, author_id, price, page_count, is_illustrated, copies, genre_id, publishing_year, publisher_id) VALUES 
    ('Книга 1', 1, 150.00, 200, TRUE, 5, 1, 2010, 1),
    ('Книга 2', 2, 250.00, 300, FALSE, 3, 2, 2015, 1),
    ('Книга 3', 1, 180.00, 150, TRUE, 2, 3, 2011, 1),
    ('Книга 4', 3, 300.00, 400, FALSE, 4, 4, 2008, 2),
    ('Книга 5', 1, 350.00, 450, true, 500, 5, 2020, 3),
    ('Книга 6', 2, 450.00, 500, true, 800, 6, 2022, 2),
    ('Книга 7', 2, 150.00, 80, false, 700, 7, 2025, 3)
;
