/* Заполнить таблицы данными. */

-- Заполнение таблицы образования
INSERT INTO employment_service.education (title) VALUES ('высшее'), ('среднее');

-- Заполнение таблицы должностей
INSERT INTO employment_service.job_position (title) VALUES 
    ('инженер-программист'),
    ('системный администратор'),
    ('агент по сбыту'),
    ('продавец-консультант'),
    ('специалист по работе с данными'),
    ('повар'),
    ('кондитер'),
    ('маркетолог'),
    ('продавец'),
    ('графический дизайнер'),
    ('администратор')
;

-- Заполнение таблицы компаний
INSERT INTO company (company_name, company_address) VALUES
    ('Tech Innovations', '123 Tech Lane, Silicon Valley, CA'),
    ('Green Solutions', '456 Eco St, San Francisco, CA'),
    ('Creative Agency', '789 Art Ave, Los Angeles, CA'),
    ('Health Corp', '321 Wellness Blvd, New York, NY'),
    ('Ресторан А', 'Москва, ул. Ленина, 1'),
    ("Mick \' Candies", 'Москва, ул. Пушкина, 2'),
    ('Finance Group', '654 Money Rd, Chicago, IL')
;

-- Заполнение таблицы вакансий
INSERT INTO vacancy(experience, salary, gender, max_age, company_id, education_id, position_id) VALUES
    (3, 150000.00, 'm', 60, 1, 1, 1),
    (3, 140000.00, 'f', 55, 1, 1, 2),
    (2, 70000.00, 'm', 60, 3, 2, 3),
    (1, 65000.00, 'f', 70, 3, 2, 4),
    (3, 140000.00, 'm', 50, 1, 1, 5),
    (1, 45000.00, 'm', 45, 5, 2, 6),
    (2, 40000.00, 'f', 50, 6, 2, 7),
    (4, 55000.00, 'm', 55, 3, 2, 8),
    (1, 60000.00, 'f', 60, 7, 2, 9),
    (3, 65000.00, 'm', 65, 3, 1, 10),
    (2, 52000.00, 'f', 70, 7, 1, 11)
;

-- Заполнение таблицы претендентов
INSERT INTO candidate(full_name, birth_date, gender, children_number, specialty, education_id, experience, salary, position_id) VALUES
    ('Иванов Иван Иванович', '1990-05-15', 'm', 0, 'инженер-программист', 1, 2, 60000.00, 1),
    ('Петрова Анна Сергеевн', '1985-10-20', 'f', 1, 'маркетолог', 1, 7, 75000.00, 8),
    ('Сидоров Алексей Петрович', '1995-02-25', 'm', 2, 'продавец', 2, 3, 40000.00, 9),
    ('Кузнецова Мария Александровна', '1980-07-30', 'f', 3, 'специалист по работе с данными', 1, 10, 95000.00, 5),
    ('Смирнов Дмитрий Викторович', '1992-12-01', 'm', 0, 'графический дизайнер', 1, 4, 55000.00, 10),
    ('Васильева Елена Андреевна', '1988-04-18', 'f', 1, 'строитель', 2, 5, 50000.00, 11),
    ('Янушкевич Николай Петрович', '1992-04-12', 'm', 1, 'повар', 2, 3, 30000.00, 6),
    ('Лобанова Ралина Германовна', '1998-06-18', 'f', 2, 'кондитер', 2, 3, 28000.00, 7),
    ('Емелина Аполлинария Нифонтовна', '2003-12-25', 'f', 1, 'администратор', 2, 2, 35000.00, 11)
;
