/* Usage (run any of the below two commands)
 * \. create-db-hotel.sql
 * source create-db-hotel.sql
*/

INSERT INTO comfort(type_name)
    VALUES
    ("обычный"),
    ("полулюкс"),
    ("люкс")
;

INSERT INTO client(last_name, first_name, second_name, passport_number, birth_date, address, comment) 
    VALUES
    ('Капралов', 'Герман', 'Петрович', '6921698435', '1961-10-21', 'ул. Дуки, д. 80, г. Брянск, Брянская обл., 241050', NULL),
    ('Сидоров', 'Сидор', 'Сидорович', '7863523156', '1975-03-08', 'ул. Советская, д. 23, г. Тверь, Тверская обл., 170100', NULL),
    ('Иванов', 'Иван', 'Иванович', '0569836879', '1985-02-16', 'Воскресенский б-р, д. 3, г. Великий Новгород, Новгородская область, 173002', 'Не любит шум'),
    ('Суворова', 'Галина', 'Ивановна', '9874563215', '1975-04-03', 'пл. Ленина, д. 2, г. Махачкала, Республика Дагестан, 367000', NULL),
    ('Петров', 'Степан', 'Викторович', '0786534882', '1965-08-21', 'ул. Калиновская, д. 38, г. Кострома, Костромская обл., 156013', NULL),
    ('Решетникова', 'Анна', 'Владимировна', '6798563549', '1973-08-09', 'ул. Победы, д. 3, корп. С, г. Назрань, Республика Ингушетия, 386102', 'Крайне обидчива'),
    ('Ян', 'Мария', 'Григорьевна', '9804356987', '1994-05-24', 'ул. Свободы, д. 46, г. Ярославль, Ярославская обл., 150000', NULL),
    ('Самохвалов', 'Юрий', 'Петрович', '7888632153', '1952-02-22', 'ул. Холодильная, д. 58а, г. Тюмень, Тюменская обл., 625048', 'Очень уважаемый человек'),
    ('Чижиков', 'Михаил', 'Николаевич', '5468654932', '2001-07-14', 'ул. Московская, д. 55, г. Казань, Республика Татарстан, 420021', NULL),
    ('Капралова', 'Светлана', 'Борисовна', '5428965246', '1975-04-19', '4-я линия В.О., д. 13, лит. А, г. Санкт-Петербург, 199004', NULL),
    ('Лапина', 'Марина', 'Александровна', '0428456828', '1988-03-17', 'пр-т Ворошиловский, д. 2/2, офис 403, г. Ростов-на-Дону, Ростовская обл., 344006', NULL),
    ('Красавин', 'Вадим', 'Анатольевич', '7689254981', '1985-03-30', 'пр-т К. Маркса, д. 12А, г. Омск, Омская обл., 644010', 'Отличный парень'),
    ('Пень', 'Юрий', 'Васильевич', '7899245684', '1949-01-01', 'ул. Книповича, д. 9а, г. Мурманск, Мурманская обл., 183038', NULL),
    ('Мединская', 'Ирина', 'Глебовна', '7788654587', '2003-12-31', 'ул. Карла Либкнехта, д. 55, г. Киров, Кировская обл., 610020', NULL),
    ('Агапова', 'Софья', 'Филипповна', '4529999542', '1948-02-13', 'ул. Жарова, д. 10, г. Иваново, Ивановская обл., 153000', 'Добрая бабуля'),
    ('Соколов', 'Михаил', 'Иванович', '5793249563', '1988-07-16', 'ул. Ленина, д. 40, г. Майкоп, Республика Адыгея, 385000', NULL),
    ('Рогов', 'Александр', 'Владимирович', '8743698421', '1953-05-30', 'ул. Улагашева, д. 13, г. Горно-Алтайск, Республика Алтай, 649000', NULL),
    ('Васильев', 'Александр', 'Александрович', '5468983123', '1958-08-12', 'пр-т Калинина, д. 8, г. Барнаул, Алтайский край, 656002', 'Историк моды'),
    ('Фролов', 'Иван', 'Павлович', '7892697635', '1979-08-03', 'ул. Амурская, д. 150, г. Благовещенск, Амурская обл., 675000', NULL),
    ('Ампилов', 'Виктор', 'Иванович', '6548652325', '2005-10-02', 'ул. Большая Московская, д. 1, г. Владимир, Владимирская обл., 600000', NULL),
    ('Суриков', 'Василий', 'Петрович', '5498324568', '1956-12-20', 'ул. 7-я Гвардейская, д. 12, г. Волгоград, Волгоградская обл., 400005', NULL),
    ('Матвиенко', 'Александр', 'Александрович', '5469842632', '1996-05-02', 'ул. К. Либкнехта, д. 2, г. Архангельск, Архангельская обл., 163000', 'футболист'),
    ('Фролова', 'Анна', 'Тарасовна', '7842359821', '1997-07-19', 'ул. Шаумяна, д. 47, г. Астрахань, Астраханская обл., 414000', NULL),
    ('Симонов', 'Александр', 'Михайлович', '4569487532', '1974-11-15', 'ул. Пушкина, д. 95, г. Уфа, Республика Башкортостан, 450008', NULL),
    ('Северов', 'Нестор', 'Петрович', '7865243896', '1965-04-29', 'ул. Ленина, д. 55, г. Улан-Удэ, Республика Бурятия, 670000', 'Новенький')
;

INSERT INTO room(number, capacity, price, phone_number, comfort_id) VALUES
    ('213', 2, 2950, '512', 1),
    ('303', 2, 4320, '128', 2),
    ('506', 3, 7800, '32', 3),
    ('225', 1, 2100, '8', 1),
    ('202', 1, 2500, '4', 1),
    ('123', 3, 3400, '1024', 1),
    ('101', 1, 2950, '256', 1),
    ('707', 5, 10580, '2', 3),
    ('555', 4, 9230, '64', 3),
    ('754', 2, 3225, '2048', 2),
    ('65', 3, 2999, '4096', 1),(
    ('78', 3, 3134, '8192', 2)
;

INSERT INTO discount(category_name, value) VALUES
    ('Герой труда', 0.15),
    ('Ликвидатор', 0.1),
    ('Постоянный', 0.25),
    ('Ветеран труда', 0.1),
    ('Многодетный',', '0.05),
    ('Сотрудник', 0.33)
;

INSERT INTO client_discount(client_id, discount_id) VALUES
    (2, 3),
    (3, 3),
    (4, 5),
    (5, 3),
    (5, 4),
    (9, 6),
    (14, 6),
    (1, 1),
    (1, 2),
    (13, 1),
    (14, 6),
    (15, 1)
;

INSERT INTO phone(number, client_id) VALUES
    (9616594269, 1),
    (9015672132, 2),
    (9315685669, 3),
    (9815642465, 4),
    (9258746921, 5),
    (9315682215, 5),
    (3477217732, 6),
    (9625982531, 7),
    (9216942498, 7),
    (9125673223, 8),
    (9216489632, 9),
    (9315795328, 9),
    (9305482211, 10),
    (9227741318, 11),
    (9268972223, 12),
    (9265672369, 13),
    (9995465757, 14),
    (3216870002, 15)
;

INSERT INTO reservation(date_ts, enter_date, leave_date, room_id, client_id) VALUES
    ('2023-10-13', '2023-11-16', '2023-12-02', 1, 1),
    ('2023-11-14', '2023-12-28', '2024-01-17', 2, 2),
    ('2023-11-17', '2024-02-12', '2024-03-06', 5, 5),
    ('2023-12-25', '2024-02-03', '2024-03-11', 7, 2),
    ('2023-11-17', '2024-01-03', '2024-01-18', 8, 7),
    ('2023-11-22', '2024-02-01', '2024-02-22', 9, 8),
    ('2023-10-13', '2023-11-16', '2023-12-2', 1, 10),
    ('2023-11-20', '2024-02-03', '2024-03-04', 3, 6),
    ('2023-11-27', '2023-12-15', '2024-01-07', 10, 14),
    ('2023-12-04', '2024-04-14', '2024-04-28', 7, 15)
;


INSERT INTO checkin(enter_date, leave_date, room_id, client_id) VALUES
    ('2023-11-16', '2023-12-10', 1, 1),
    ('2023-12-28', '2024-01-17', 2, 2),
    ('2023-11-14', '2023-11-28', 3, 3),
    ('2023-12-01', '2023-12-29', 4, 4),
    ('2023-12-12', '2024-01-05', 6, 6),
    ('2023-11-26', '2023-12-04', 10, 9),
    ('2023-11-16', '2023-12-10', 1, 10),
    ('2023-11-17', '2023-11-25', 5, 12),
    ('2023-11-19', '2023-11-23', 5, 11),
    ('2023-11-16', '2023-12-31', 2, 13),
    ('2018-07-15', '2018-08-30', 11, 20),
    ('2023-12-12', '2024-01-01', 15, 23),
    ('2018-01-01', '2018-04-28', 15, 23)
;
